

# CLI Essentials
brew 'uv'
brew 'git'          # Version controll
brew 'neovim'       # Text editor
brew 'tmux'         # Term multiplexer
brew 'coreutils'
brew 'gzip'
brew 'zstd'
brew 'unzip'
brew 'bzip2', link: true
brew 'ripgrep'
brew 'starship'
brew 'atuin'
brew 'awscli'
brew 'azure-cli'
brew 'git-lfs'
brew 'btop'
brew 'yt-dlp'



# CLI Basics
brew 'aria2'        # Resuming download util (better wget)
brew 'bat'          # Output highlighting (better cat)
brew 'broot'        # Interactive directory navigation
brew 'ctags'        # Indexing of file info + headers
brew 'diff-so-fancy'# Readable file compares (better diff)
brew 'duf'          # Get info on mounted disks (better df)
brew 'entr'         # Run command whenever file changes
brew 'exiftool'     # Read, write and modify exif data
brew 'fzf'          # Fuzzy file finder and filtering
brew 'hyperfine'    # Benchmarking for arbitrary commands
brew 'jdupes'       # Duplicate file finder
brew 'just'         # Powerful command runner (better make)
brew 'jq'           # JSON parser, output and query files
brew 'most'         # Multi-window scroll pager (better less)
brew 'procs'        # Advanced process viewer (better ps)
brew 'ripgrep'      # Searching within files (better grep)
brew 'rsync'        # Fast incremental file transfer
brew 'sd'           # RegEx find and replace (better sed)
brew 'thefuck'      # Auto-correct miss-typed commands
brew 'tldr'         # Community-maintained docs (better man)
brew 'tokei'        # Count lines of code (better cloc)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'watch'        # Run commands periorically
brew 'xsel'         # Copy paste access to the X clipboard
brew 'zoxide'       # Auto-learning navigation (better cd)
brew 'eza'	    # Better ls
brew 'choose'       # human-friendly cut


# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor
brew 'ctop'         # Container metrics and monitoring
brew 'bpytop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'glances'      # Resource monitor + web and API
brew 'goaccess'     # Web log analyzer and viewer
brew 'gping'        # Interactive ping tool, with graph
brew 'speedtest-cli'# Command line speed test utility


# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazygit'      # Full Git management app

# Development Apps
brew 'gcc'            # GNU C++ compilers
brew 'go'             # Compiler for Go Lang
cask 'visual-studio-code' # Code editor
brew 'python'         # Python interpreter
brew 'rust'           # Rust language

# Development Utils
brew 'gh'             # Interact with GitHub PRs, issues, repos
brew 'git-extras'     # Extra git commands for common tasks
brew 'ttygif'         # Generate GIF from terminal commands + output

brew 'bettercap'      # Network, scanning and monitoring
brew 'nmap'           # Port scanning
brew 'wrk'            # HTTP benchmarking

brew 'openssl'        # Cryptography and SSL/TLS Toolkit

#############################################################
# Desktop Applications                                      #
#############################################################

cask 'spotify', args: { require_sha: false } # Propietary music streaming
cask 'vlc'          # Media player
cask 'iina'
brew 'pandoc'       # Universal file converter

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'discord'
cask 'bitwarden'


# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'

# Mac OS Mods and Imrovments
cask 'alt-tab'        # Much better alt-tab window switcher
cask 'raycast', args: { require_sha: false }  # Spotlight alternative
cask 'shottr'         # Better screenshot utility

cask 'keka'           # File archiver and extractor

cask "notion"
cask "rectangle"
cask "obsidian"
cask "zoom"

cask "claude-code"
cask "warp"
cask "cursor"
cask "codex"
cask "zed"
cask "chatgpt"
cask "telegram"
cask "google-drive"

cask 'ticktick'
cask 'betterdisplay'
cask 'ghostty'

cask 'maccy'
cask 'font-meslo-lg-nerd-font'
cask 'localsend'

cask 'granola'
cask 'numi'
cask 'pinta'
cask 'positron'

cask 'whatsapp'
cask 'antigravity'
cask 'jordanbaird-ice'
cask 'keepingyouawake'
cask 'helium-browser'
cask 'discord'
cask 'popclip'
cask 'bloom'
cask 'windsurf'
cask 'gcloud-cli'
